tutorials/azimuthalAverageSetup/case3D/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0.0125 0.0 0)
    (7.654042494670958e-19 0.0125 0)
    (-0.0125 1.5308084989341916e-18 0)
    (-2.296212748401287e-18 -0.0125 0)
    (0.0125 0.0 0.1)
    (7.654042494670958e-19 0.0125 0.1)
    (-0.0125 1.5308084989341916e-18 0.1)
    (-2.296212748401287e-18 -0.0125 0.1)
    (0.05 0.0 0)
    (3.061616997868383e-18 0.05 0)
    (0.05 0.0 0.1)
    (3.061616997868383e-18 0.05 0.1)
    (-0.05 6.123233995736766e-18 0)
    (-0.05 6.123233995736766e-18 0.1)
    (-9.184850993605149e-18 -0.05 0)
    (-9.184850993605149e-18 -0.05 0.1)
    (0.1 0.0 0)
    (6.123233995736766e-18 0.1 0)
    (0.1 0.0 0.1)
    (6.123233995736766e-18 0.1 0.1)
    (-0.1 1.2246467991473533e-17 0)
    (-0.1 1.2246467991473533e-17 0.1)
    (-1.8369701987210297e-17 -0.1 0)
    (-1.8369701987210297e-17 -0.1 0.1)
);

edges
(
    arc 8 9 (0.03535533905932738 0.03535533905932738 0)
    arc 10 11 (0.03535533905932738 0.03535533905932738 0.1)
    arc 9 12 (-0.035355339059327376 0.03535533905932738 0)
    arc 11 13 (-0.035355339059327376 0.03535533905932738 0.1)
    arc 12 14 (-0.03535533905932738 -0.035355339059327376 0)
    arc 13 15 (-0.03535533905932738 -0.035355339059327376 0.1)
    arc 14 8 (0.03535533905932737 -0.03535533905932738 0)
    arc 15 10 (0.03535533905932737 -0.03535533905932738 0.1)
    arc 16 17 (0.07071067811865477 0.07071067811865477 0)
    arc 18 19 (0.07071067811865477 0.07071067811865477 0.1)
    arc 17 20 (-0.07071067811865475 0.07071067811865477 0)
    arc 19 21 (-0.07071067811865475 0.07071067811865477 0.1)
    arc 20 22 (-0.07071067811865477 -0.07071067811865475 0)
    arc 21 23 (-0.07071067811865477 -0.07071067811865475 0.1)
    arc 22 16 (0.07071067811865474 -0.07071067811865477 0)
    arc 23 18 (0.07071067811865474 -0.07071067811865477 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (10 10 40)
    simpleGrading (1 1 ( (0.024999999999999998 1 1.0) (0.975 39 1) ))
    hex (0 8 9 1 4 10 11 5)
    (27 10 40)
    simpleGrading (( (0.9375 25 1) (0.0625 2 0.6666666666666666) ) 1 ( (0.024999999999999998 1 1.0) (0.975 39 1) ))
    hex (1 9 12 2 5 11 13 6)
    (27 10 40)
    simpleGrading (( (0.9375 25 1) (0.0625 2 0.6666666666666666) ) 1 ( (0.024999999999999998 1 1.0) (0.975 39 1) ))
    hex (2 12 14 3 6 13 15 7)
    (27 10 40)
    simpleGrading (( (0.9375 25 1) (0.0625 2 0.6666666666666666) ) 1 ( (0.024999999999999998 1 1.0) (0.975 39 1) ))
    hex (3 14 8 0 7 15 10 4)
    (27 10 40)
    simpleGrading (( (0.9375 25 1) (0.0625 2 0.6666666666666666) ) 1 ( (0.024999999999999998 1 1.0) (0.975 39 1) ))
    hex (8 16 17 9 10 18 19 11)
    (40 10 40)
    simpleGrading (1 1 ( (0.024999999999999998 1 1.0) (0.975 39 1) ))
    hex (9 17 20 12 11 19 21 13)
    (40 10 40)
    simpleGrading (1 1 ( (0.024999999999999998 1 1.0) (0.975 39 1) ))
    hex (12 20 22 14 13 21 23 15)
    (40 10 40)
    simpleGrading (1 1 ( (0.024999999999999998 1 1.0) (0.975 39 1) ))
    hex (14 22 16 8 15 23 18 10)
    (40 10 40)
    simpleGrading (1 1 ( (0.024999999999999998 1 1.0) (0.975 39 1) ))
);

patches
(
    wall freeSurf
    (
    (11 10 18 19)
    (13 11 19 21)
    (15 13 21 23)
    (10 15 23 18)
    )
    wall crysSurf
    (
    (7 4 5 6)
    (5 4 10 11)
    (6 5 11 13)
    (7 6 13 15)
    (4 7 15 10)
    )
    wall side
    (
    (16 17 19 18)
    (17 20 21 19)
    (20 22 23 21)
    (22 16 18 23)
    )
    wall bottom
    (
    (2 1 0 3)
    (9 8 0 1)
    (12 9 1 2)
    (14 12 2 3)
    (8 14 3 0)
    (17 16 8 9)
    (20 17 9 12)
    (22 20 12 14)
    (16 22 14 8)
    )
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
