tutorials/azimuthalAverageSetup/case3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


4
(
    freeSurf
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          1600;
        startFace       330020;
    }

    crysSurf
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          1180;
        startFace       331620;
    }

    side
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          1600;
        startFace       332800;
    }

    bottom
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          2780;
        startFace       334400;
    }

)


// ************************************************************************* //
